_posts/stop-rewrites.html
---
layout: default
title: Consider Not Doing That Rewrite
date: 2021-12-08
categories: software-engineering
---
<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
I&rsquo;ve always heard the software engineering industry is a rapidly changing
industry. One of the things that contributes to it (and not the other way
around) is the frequency at which we abandon a pile of work and just start anew.
</p>

<p>
I have not had good experience with this, and this post will go into why. At a
very high level, here&rsquo;s there&rsquo;s one really big point I want to drive home:
Rewrites won&rsquo;t unburden a project from technical debt.
</p>
</div>
</div>
<div id="outline-container-technical-debt" class="outline-2">
<h2 id="technical-debt"><span class="section-number-2">2.</span> Technical Debt</h2>
<div class="outline-text-2" id="text-technical-debt">
<p>
To understand more deeply about why we want to rewrite a particular piece of
software, we need to first understand the prime motivation and establish it in
this article&rsquo;s lexicon.
</p>

<p>
Technical debt is, in its vaguest sense, a shortcut taken. In the interest of
short term gains, long term gains are sacrificed. This isn&rsquo;t always as sinister
as it sounds. However, projects can become so weighed down by their technical
debt that they cannot move forward anymore. Let&rsquo;s go through a thought
experiment that has nothing at all to do with software.
</p>

<p>
We all have busy days. Let&rsquo;s imagine a day where things get busy: You skip
brushing your teeth in the morning so you can squeeze in a few more minutes to
get to work. Your teeth are external facing bones - they can survive a day of
the bacteria running unchecked. At work, you order the fastest food you can get
and eat it at your desk so you can have more desk time or you don&rsquo;t miss that
meeting. The food isn&rsquo;t healthy, but your stomach acid can strip impurities off
of steel - you&rsquo;ll be alright with one more grease bomb. When you return home
(late), you order some pizza because you can&rsquo;t be bothered to make dinner, and
you barely get to say hello to your children, let alone talk to them about their
lives, school work, etc before they have to go to bed. By the time you&rsquo;re all
done, you&rsquo;re exhausted, so you watch TV for the rest of the night. Eventually
you fall asleep and start the cycle anew. Hopefully tomorrow will go better.
</p>

<p>
I think we&rsquo;ve all had days like this. Ideally, it&rsquo;s painfully obvious that at
if all of this stuff keeps up, you&rsquo;ll need to go to the dentist and get a root
canal. The food you ate will transform your gut bacteria to demand more pizza
and grease bombs. Your kids will grow far apart from you, because you&rsquo;re never
available to be present in their lives. My point probably sounds asinine, but we
all suffer from it. We catch ourselves trying too hard at a particular thing for
weeks on end. We course correct, and we try to make space for all the busy stuff
in life, and focus on the few things that are truly important to us.
</p>

<p>
The grease bomb, pizza, and neglected dental hygiene are all forms of technical
debt that you are conscious of. What about sitting at your desk all day?
Sedentary lifestyles aren&rsquo;t considered healthy. There&rsquo;s many forms of short-cut
decisions made that you weren&rsquo;t even aware of. This also applies to technical
debt.
</p>

<p>
In the software industry, we tend to use technical debt as a mark of shame. But
really, no software project is absent of it. At some point, we need to do
something and move on.
</p>

<p>
That said, technical debt can run unchecked. The blame can be relatively equal:
The software engineers on a project are only so patient, and the folks cutting
the checks for software engineer salaries can&rsquo;t write blank checks. At some
point the project must launch. Maybe you think you have a project with no
technical debt, and maybe that&rsquo;s true - but is that project actually in use?
Without a time constraint, it can be very difficult to finish a project.
</p>

<p>
We do have a few techniques on how to avoid this, and I&rsquo;ll try going into some
of that. Let&rsquo;s take a look at the old software we want to rewrite.
</p>
</div>
</div>
<div id="outline-container-legacy" class="outline-2">
<h2 id="legacy"><span class="section-number-2">3.</span> Legacy</h2>
<div class="outline-text-2" id="text-legacy">
<p>
Software is not often viewed as fine wines - they do not age nicely. Words like
&ldquo;cruft&rdquo;, and &ldquo;hacky&rdquo; get thrown around. Legacy is oftentimes the term we give to
a project we don&rsquo;t like anymore, because it uses that old technology that
doesn&rsquo;t make our résumés look good. It has poor decisions made against it which
have accumulated worse than barnacles on the hull of a ship. Legacy should truly
mean &ldquo;It&rsquo;s in use&rdquo;, or &ldquo;It&rsquo;s in production&rdquo;, rather than that old pile of slop
that we liken to Jim Crow laws.
</p>

<p>
Legacy is powerful. It means your software is in use. Don&rsquo;t ever turn your back
on legacy. Unless you&rsquo;re a startup that&rsquo;s yet to launch, chances are legacy is
what pays your bills. Without it, you are nothing.
</p>

<p>
Legacy can still be hard to work with though. Changing one part of the software
is likely to break some poorly tested or documented behavior. Rolling out
changes, once they are made, can be frustrating and error prone. Generally, the
engineers on the project won&rsquo;t feel like they are setup for success, and they
won&rsquo;t feel like the organization appreciates their efforts, let alone supports
them. This might be far from the truth, but one easy way to make a software
engineer feel bad about their work is to make their work impossible to succeed.
Legacy systems are generally really good at that.
</p>

<p>
One of the ways an organization tries to deal with technical debt is by hiring
people who can either work on new shiny replacements, or maintain the legacy
software. Pulling in more talent might be the right move, but it won&rsquo;t solve the
real issue. Throwing enough money at the problem might look like a great idea on
paper, but it neglects the cause of technical debt in the first place. A mistake
not learned is a mistaken doomed for repetition.
</p>

<p>
To restate that point, because of its importance: Rewriting software will not
buy any reprieve from technical debt.
</p>
</div>
</div>
<div id="outline-container-the-model" class="outline-2">
<h2 id="the-model"><span class="section-number-2">4.</span> The Model</h2>
<div class="outline-text-2" id="text-the-model">
<p>
The model is the core of any software endeavor. I&rsquo;m not talking about doing UML
modeling necessarily. A model is a representation - full stop. Models are
created and enforced by the software. A legacy system with no documented model
still has one - it&rsquo;s just invisible. These are some of the worst models, because
it&rsquo;s only sitting partially in gray matter (someone&rsquo;s brains), which we know to
be a faulty storage and retrieval system.
</p>

<p>
Maybe your model is well documented, but your software is riddled with edge
cases. All that means is that you have two models: The model you want, and the
model you have. The software has the final say on the model.
</p>

<p>
To establish a good model, you need two big habits to start with:
</p>
<ol class="org-ol">
<li>You maintain your documentation, so your written model and actual model are
never far apart.</li>
<li>You have a far-seeing perspective on the direction of the project.</li>
</ol>

<p>
These are easier said than done.
</p>
</div>
