stop-rewrites.org
** Maintaining Documentation
Maintaining documentation is tricky. Too much documentation and it's a pain to
read, and easy to miss things. Too little documentation, and you diverge from
your actual model. I could write an entire post about documentation and I'd
probably still need to break it apart. What I can offer for documentation being
both good and relevant is the documentation's locality, and abandoning the idea
that documentation can skip be skipped.

Locality of documentation is simply how close the documentation is to the
subject matter, in terms of its physical proximity. For example, surprising
twists and turns in the source code should be documented right where those
twists and turns are made, as code comments. Justify why you are doing something
surprising. It makes your code easier to review, and easier for those hacks to
potentially be removed in the future if their justification is no longer
relevant. Without those kinds of code comments, you're leaving future
generations to have to remove a vital organ from the patient in order to
discover what that organ was doing.

For documentation that's more overarching for your application, don't
document that in your application's entrypoint. Move to a README, or even
better: a place where you can put up diagrams and link to other documentation
(READMEs can be great entrypoints for this as well, but not all readers will
have access to your source code, nor want it).

The single greatest sin of the Agile Manifesto is the words "Prefer working
software over documentation". They are referring to giant contracting work where
documentation is forever but there's no actual working software yet because it
wasn't written yet. There's a painted picture of giant organizations that get
lost in software requirements and documentation, but don't forget, NASA works
that way and, to date, no small startup has landed on the Moon by building a
rocket one week at a time. The painted picture is skewed, inaccurate - or at
least how its come to manifest in the minds of the community. The number of Ruby
libraries whose documentation is simply the RDoc comments begrudgingly left in
the codebase (and perhaps ignored) is testament to this. Ruby had its hay day
but that day is gone. It turns out the ecosystem is just not great for long term
software projects. The attitude of "look at the code" for documentation is not
sustainable.

** Perspective on What's to Come

Knowing what you're building is so essential if you're building it. While I
loathe the actual construction metaphor we use in software engineering, this is
a place where it is apt. You can construct a building precisely one room at a
time, but if you don't know how tall the building is going to be (one story, or
a sky scraper?), or how many rooms you'll need, and what the purposes of the
rooms will be, things are going to get really tricky. Plumbing, electrical, and
ventilation all need planning, and it changes at larger scales. The ventilation
and electrical needs differ between bedrooms, kitchens, gyms, and bathrooms.

It doesn't mean you need every exacting detail up front, but it does mean you
need a good idea of where you're going. It's impossible to know exactly what is
desired from a given project. Software engineers building software for
themselves can't even get this right.

But it helps. If you're making a text editor, have you thought about how your
key bindings are going to work, or are you just going to add them as you go? The
former leads to Vim's composable key bindings. The latter leads to TextMate,
which keeps getting reincarnated (TextMate 2, Sublime, Atom, VS Code, and
whatever is next). Meanwhile, Vim is 30 years old and still attracts new users.
Emacs enjoys a 45 year age - it doesn't use composable key bindings (unless you
count =evil-mode=), but it has a solid model built into its customization.
TextMate might not even be the first in its lineage, but rest assured there will
come more. At some point, the editor just becomes so bloated with various needs
pressed upon it that nobody can make anything new for it. Features are riddled
with obscure quirks and keeping the system able to build on modern platforms
becomes increasingly difficult. I haven't even seen these code bases and I know
this to be true, and the evidence is in the lineage: We keep making the same
editor over and over again. Why is that? Why weren't we happy with Atom? Why do
people still learn Emacs and Vim? One set had a model, and the other set were a
Minimal Viable Products (MVP).

Gaining this perspective takes time where engineers aren't twiddling bits and
writing code. It takes time where documents are put together, and understanding
is laid out. Make room for this, lest you lose the true model of the
application. You'll know you missed the mark when you feel like your application
is riddled with edge cases.

** Edge Cases

We've talked a little bit about edge cases but haven't established exactly what
they are. Edge cases are simply exceptions. Spelling in the English language is
riddled with edge cases. [[https://www.econtentpro.com/blog/i-before-e-except-after-c-exceptions/18]["I before E except after C"]] is a really common one, but
even the linked article I point to says there are exceptions to that exception.
Exceptception! But software gets like that too. We say we always do this one
thing for billing, except in the case of that one client. Our application
displays a table with 8 columns, except when the first record has a certain
value and then it's either 5 columns or 12.

Edge cases is the real model coming out, and the engineers on the project are
chasing it like a rainbow. Edge cases are a sign that the code is too specific.
It needs more generic things in place so it can hinge at certain points more
easily. If a particular action needs to be done by a certain client, don't make
that happen for the client - use your data (model) to handle that via some kind
of flag or other state you can examine. Then that client is flagged with the
state you expect. Huzzah! Now the state you're talking about is not specific to
the client. When you see this state, you do this other thing. If you see a
different state, you might do something else entirely. It's a system that now
expresses not just one thing thought to be an exception, but all of the
exceptions!

Coming back to English, English is composed of many languages, but has its
lineage in a Germanic language and a Latin language (French, I believe).
Knowing the origin of the word (Germanic, Latin, or even something else like
Greek) significantly assists in its spelling. English requires a more complex
model of a language because of its split heritage. While planning things out is
important, software is just as organic as a spoken language. It must adapt to
changing circumstances, and no design will be perfect for all possible futures.
This why it's important to cultivate a sense of understanding of the code base,
and understand that looking at an edge case is really just a place where your
desired model needs to catch up with the actual model.




