_posts/stop-rewrites.html
<div id="outline-container-the-model--maintaining-documentation" class="outline-3">
<h3 id="the-model--maintaining-documentation"><span class="section-number-3">4.1.</span> Maintaining Documentation</h3>
<div class="outline-text-3" id="text-the-model--maintaining-documentation">
<p>
Maintaining documentation is tricky. Too much documentation and it&rsquo;s a pain to
read, and easy to miss things. Too little documentation, and you diverge from
your actual model. I could write an entire post about documentation and I&rsquo;d
probably still need to break it apart. What I can offer for documentation being
both good and relevant is the documentation&rsquo;s locality, and abandoning the idea
that documentation can skip be skipped.
</p>

<p>
Locality of documentation is simply how close the documentation is to the
subject matter, in terms of its physical proximity. For example, surprising
twists and turns in the source code should be documented right where those
twists and turns are made, as code comments. Justify why you are doing something
surprising. It makes your code easier to review, and easier for those hacks to
potentially be removed in the future if their justification is no longer
relevant. Without those kinds of code comments, you&rsquo;re leaving future
generations to have to remove a vital organ from the patient in order to
discover what that organ was doing.
</p>

<p>
For documentation that&rsquo;s more overarching for your application, don&rsquo;t
document that in your application&rsquo;s entrypoint. Move to a README, or even
better: a place where you can put up diagrams and link to other documentation
(READMEs can be great entrypoints for this as well, but not all readers will
have access to your source code, nor want it).
</p>

<p>
The single greatest sin of the Agile Manifesto is the words &ldquo;Prefer working
software over documentation&rdquo;. They are referring to giant contracting work where
documentation is forever but there&rsquo;s no actual working software yet because it
wasn&rsquo;t written yet. There&rsquo;s a painted picture of giant organizations that get
lost in software requirements and documentation, but don&rsquo;t forget, NASA works
that way and, to date, no small startup has landed on the Moon by building a
rocket one week at a time. The painted picture is skewed, inaccurate - or at
least how its come to manifest in the minds of the community. The number of Ruby
libraries whose documentation is simply the RDoc comments begrudgingly left in
the codebase (and perhaps ignored) is testament to this. Ruby had its hay day
but that day is gone. It turns out the ecosystem is just not great for long term
software projects. The attitude of &ldquo;look at the code&rdquo; for documentation is not
sustainable.
</p>
</div>
</div>
<div id="outline-container-the-model--perspective-on-what's-to-come" class="outline-3">
<h3 id="the-model--perspective-on-what's-to-come"><span class="section-number-3">4.2.</span> Perspective on What&rsquo;s to Come</h3>
<div class="outline-text-3" id="text-the-model--perspective-on-what's-to-come">
<p>
Knowing what you&rsquo;re building is so essential if you&rsquo;re building it. While I
loathe the actual construction metaphor we use in software engineering, this is
a place where it is apt. You can construct a building precisely one room at a
time, but if you don&rsquo;t know how tall the building is going to be (one story, or
a sky scraper?), or how many rooms you&rsquo;ll need, and what the purposes of the
rooms will be, things are going to get really tricky. Plumbing, electrical, and
ventilation all need planning, and it changes at larger scales. The ventilation
and electrical needs differ between bedrooms, kitchens, gyms, and bathrooms.
</p>

<p>
It doesn&rsquo;t mean you need every exacting detail up front, but it does mean you
need a good idea of where you&rsquo;re going. It&rsquo;s impossible to know exactly what is
desired from a given project. Software engineers building software for
themselves can&rsquo;t even get this right.
</p>

<p>
But it helps. If you&rsquo;re making a text editor, have you thought about how your
key bindings are going to work, or are you just going to add them as you go? The
former leads to Vim&rsquo;s composable key bindings. The latter leads to TextMate,
which keeps getting reincarnated (TextMate 2, Sublime, Atom, VS Code, and
whatever is next). Meanwhile, Vim is 30 years old and still attracts new users.
Emacs enjoys a 45 year age - it doesn&rsquo;t use composable key bindings (unless you
count <code>evil-mode</code>), but it has a solid model built into its customization.
TextMate might not even be the first in its lineage, but rest assured there will
come more. At some point, the editor just becomes so bloated with various needs
pressed upon it that nobody can make anything new for it. Features are riddled
with obscure quirks and keeping the system able to build on modern platforms
becomes increasingly difficult. I haven&rsquo;t even seen these code bases and I know
this to be true, and the evidence is in the lineage: We keep making the same
editor over and over again. Why is that? Why weren&rsquo;t we happy with Atom? Why do
people still learn Emacs and Vim? One set had a model, and the other set were a
Minimal Viable Products (MVP).
</p>

<p>
Gaining this perspective takes time where engineers aren&rsquo;t twiddling bits and
writing code. It takes time where documents are put together, and understanding
is laid out. Make room for this, lest you lose the true model of the
application. You&rsquo;ll know you missed the mark when you feel like your application
is riddled with edge cases.
</p>
</div>
</div>
<div id="outline-container-the-model--edge-cases" class="outline-3">
<h3 id="the-model--edge-cases"><span class="section-number-3">4.3.</span> Edge Cases</h3>
<div class="outline-text-3" id="text-the-model--edge-cases">
<p>
We&rsquo;ve talked a little bit about edge cases but haven&rsquo;t established exactly what
they are. Edge cases are simply exceptions. Spelling in the English language is
riddled with edge cases. <a href="https://www.econtentpro.com/blog/i-before-e-except-after-c-exceptions/18">&ldquo;I before E except after C&rdquo;</a> is a really common one, but
even the linked article I point to says there are exceptions to that exception.
Exceptception! But software gets like that too. We say we always do this one
thing for billing, except in the case of that one client. Our application
displays a table with 8 columns, except when the first record has a certain
value and then it&rsquo;s either 5 columns or 12.
</p>

<p>
Edge cases is the real model coming out, and the engineers on the project are
chasing it like a rainbow. Edge cases are a sign that the code is too specific.
It needs more generic things in place so it can hinge at certain points more
easily. If a particular action needs to be done by a certain client, don&rsquo;t make
that happen for the client - use your data (model) to handle that via some kind
of flag or other state you can examine. Then that client is flagged with the
state you expect. Huzzah! Now the state you&rsquo;re talking about is not specific to
the client. When you see this state, you do this other thing. If you see a
different state, you might do something else entirely. It&rsquo;s a system that now
expresses not just one thing thought to be an exception, but all of the
exceptions!
</p>

<p>
Coming back to English, English is composed of many languages, but has its
lineage in a Germanic language and a Latin language (French, I believe).
Knowing the origin of the word (Germanic, Latin, or even something else like
Greek) significantly assists in its spelling. English requires a more complex
model of a language because of its split heritage. While planning things out is
important, software is just as organic as a spoken language. It must adapt to
changing circumstances, and no design will be perfect for all possible futures.
This why it&rsquo;s important to cultivate a sense of understanding of the code base,
and understand that looking at an edge case is really just a place where your
desired model needs to catch up with the actual model.
</p>
</div>
</div>
</div>
