stop-rewrites.org
* Other Costs of Rewriting

Rewriting software is a colossal ask. It's basically saying "I need to disappear
for months, and I will come back with a piece of software that is not in feature
parity with the old software, and it will actually have more bugs than the old
software because it isn't as battle tested". And you might think "Oh I'm
rewriting it in language X which has strong/static types" or "I have a new
testing methodology that will make it impossible to miss such obvious things
next time", and you're both right and wrong. You'll find the organization won't
tolerate you disappearing for so long (even if they signed up for it initially),
and you're back at the point where you are motivated to cut corners again. Once
again, you're making those tradeoffs which favor short term gains for long term
gains, because this thing needs to get out the door. Meanwhile, that legacy
system keeps paying the bills.

So once you convince the organization to do the rewrite, and you do it, you'll
forever have this mark upon you. Never again will you be allowed to do a
rewrite. Fresh blood might be able to make the pitch and say the right things,
but you're done. And why should it be any other way? The organization extended
you trust, and you managed to make a clone that's just a little more shiny for
new prospective engineers. That was not what was promised. Even if they helped
you create another pile of technical debt.

* So What, I'm stuck with X while the world moves onto Y?

This isn't to say you can't update things. I dislike how much "software
engineering" equates to "web development" - there are many other disciplines
within software than just web applications! I also feel like I'm often at odds
with the opinions of Martin Fowler, but his article on [[https://martinfowler.com/bliki/StranglerFigApplication.html][StrangleFigApplication]] is
spot on. Credit where credit is due!

The gist is that if you need a new system, you need to build it around or within
the legacy system. Have the old system start deferring calls to the new system,
or wrap the legacy system in the new system, and have the new system start by
deferring _all_ of its calls to the legacy system. Sure it has overhead, but I
bet it's overhead you can afford. You're in legacy, remember? This allows you to
safely swap out small pieces of the application at a time, until eventually the
legacy system either no longer called or just a hallow shell of its former self.
At some critical point, you flip the rest over.

This will let you move to new frameworks, or even runtimes. Depending on your
domain, this might have some obstacles to overcome. I don't know how you'd
migrate a Unity3D game to Unreal. Maybe there's some techniques though. You can
figure out a strategy (like move your primary game logic to something that both
Unity3D and Unreal can operate with).

For web calls, this is basically setting up a reverse proxy between the new and
legacy system.

* But you said I'll still have technical debt

I did say you'll still have technical debt. You need to cultivate the skill of
cleaning as you go, and sometimes just leveraging time to actually work on a
proper solution. Though I will say, once you've seen abstract solutions to your
problems, it becomes easier to just put them in to begin with. That first client
exception that comes in introduces a tag applied to clients that introduces
additional behavior.

* Legacy Ain't All That Bad

If you're stuck on a legacy system, know that while you probably have some
difficult times, and you feel like you're trudging through a murky bog, keep in
mind that time has different meaning to you than an unproven startup. Those
startups are essentially bleeding out until they can launch and then staunch the
blood (money) flow. In legacy, you're at least up and running. The trick is to
avoid egg-on-face, such as promising the world so you can get that rewrite.
Don't do it!
