_posts/stop-rewrites.html
<div id="outline-container-other-costs-of-rewriting" class="outline-2">
<h2 id="other-costs-of-rewriting"><span class="section-number-2">5.</span> Other Costs of Rewriting</h2>
<div class="outline-text-2" id="text-other-costs-of-rewriting">
<p>
Rewriting software is a colossal ask. It&rsquo;s basically saying &ldquo;I need to disappear
for months, and I will come back with a piece of software that is not in feature
parity with the old software, and it will actually have more bugs than the old
software because it isn&rsquo;t as battle tested&rdquo;. And you might think &ldquo;Oh I&rsquo;m
rewriting it in language X which has strong/static types&rdquo; or &ldquo;I have a new
testing methodology that will make it impossible to miss such obvious things
next time&rdquo;, and you&rsquo;re both right and wrong. You&rsquo;ll find the organization won&rsquo;t
tolerate you disappearing for so long (even if they signed up for it initially),
and you&rsquo;re back at the point where you are motivated to cut corners again. Once
again, you&rsquo;re making those tradeoffs which favor short term gains for long term
gains, because this thing needs to get out the door. Meanwhile, that legacy
system keeps paying the bills.
</p>

<p>
So once you convince the organization to do the rewrite, and you do it, you&rsquo;ll
forever have this mark upon you. Never again will you be allowed to do a
rewrite. Fresh blood might be able to make the pitch and say the right things,
but you&rsquo;re done. And why should it be any other way? The organization extended
you trust, and you managed to make a clone that&rsquo;s just a little more shiny for
new prospective engineers. That was not what was promised. Even if they helped
you create another pile of technical debt.
</p>
</div>
</div>
<div id="outline-container-so-what-i'm-stuck-with-x-while-the-world-moves-onto-y" class="outline-2">
<h2 id="so-what-i'm-stuck-with-x-while-the-world-moves-onto-y"><span class="section-number-2">6.</span> So What, I&rsquo;m stuck with X while the world moves onto Y?</h2>
<div class="outline-text-2" id="text-so-what-i'm-stuck-with-x-while-the-world-moves-onto-y">
<p>
This isn&rsquo;t to say you can&rsquo;t update things. I dislike how much &ldquo;software
engineering&rdquo; equates to &ldquo;web development&rdquo; - there are many other disciplines
within software than just web applications! I also feel like I&rsquo;m often at odds
with the opinions of Martin Fowler, but his article on <a href="https://martinfowler.com/bliki/StranglerFigApplication.html">StrangleFigApplication</a> is
spot on. Credit where credit is due!
</p>

<p>
The gist is that if you need a new system, you need to build it around or within
the legacy system. Have the old system start deferring calls to the new system,
or wrap the legacy system in the new system, and have the new system start by
deferring <span class="underline">all</span> of its calls to the legacy system. Sure it has overhead, but I
bet it&rsquo;s overhead you can afford. You&rsquo;re in legacy, remember? This allows you to
safely swap out small pieces of the application at a time, until eventually the
legacy system either no longer called or just a hallow shell of its former self.
At some critical point, you flip the rest over.
</p>

<p>
This will let you move to new frameworks, or even runtimes. Depending on your
domain, this might have some obstacles to overcome. I don&rsquo;t know how you&rsquo;d
migrate a Unity3D game to Unreal. Maybe there&rsquo;s some techniques though. You can
figure out a strategy (like move your primary game logic to something that both
Unity3D and Unreal can operate with).
</p>

<p>
For web calls, this is basically setting up a reverse proxy between the new and
legacy system.
</p>
</div>
</div>
<div id="outline-container-but-you-said-i'll-still-have-technical-debt" class="outline-2">
<h2 id="but-you-said-i'll-still-have-technical-debt"><span class="section-number-2">7.</span> But you said I&rsquo;ll still have technical debt</h2>
<div class="outline-text-2" id="text-but-you-said-i'll-still-have-technical-debt">
<p>
I did say you&rsquo;ll still have technical debt. You need to cultivate the skill of
cleaning as you go, and sometimes just leveraging time to actually work on a
proper solution. Though I will say, once you&rsquo;ve seen abstract solutions to your
problems, it becomes easier to just put them in to begin with. That first client
exception that comes in introduces a tag applied to clients that introduces
additional behavior.
</p>
</div>
</div>
<div id="outline-container-legacy-ain't-all-that-bad" class="outline-2">
<h2 id="legacy-ain't-all-that-bad"><span class="section-number-2">8.</span> Legacy Ain&rsquo;t All That Bad</h2>
<div class="outline-text-2" id="text-legacy-ain't-all-that-bad">
<p>
If you&rsquo;re stuck on a legacy system, know that while you probably have some
difficult times, and you feel like you&rsquo;re trudging through a murky bog, keep in
mind that time has different meaning to you than an unproven startup. Those
startups are essentially bleeding out until they can launch and then staunch the
blood (money) flow. In legacy, you&rsquo;re at least up and running. The trick is to
avoid egg-on-face, such as promising the world so you can get that rewrite.
Don&rsquo;t do it!
</p>
</div>
</div>
